"""База данных вариантов лабораторной работы № 2."""

from typing import Any, Dict

VARIANTS_DB: Dict[int, Dict[str, Any]] = {
    1: {
        "ciphertext": "щковмтчгфюсякяфртичгфдесявжтрдясзруярдэсчфбефючхрэръвжмвгячхбрйебэчфчфгстнгюамвмякуежюутвщжнбеъкгфнчдщтндвсэчфкфмкукфмвежвэвссолкмгкжкфявруэеймчдфеэебчдмтвгяромеъвмч",
    },
    2: {
        "ciphertext": "шмиснякнижшмъмшзйюкчолвршбкчкырвфплрпумбкжвшбнсгшрмегуънмсъкывшткчпепфыкюмъмывчукчолврнюпвсмчоемвбюнтемкюкиояъмывинюпшмрем",
    },
    3: {
        "ciphertext": "щгзшмпвжгщгзфвлыоцунпыщумжгфбгъгйвщйртжыпыщщгзъгъвйвпнздтпнунхбгтжфвпдъвйыпгъъдтийвувоыицмлбгщгзъгбмучытънхбгтжщныщцвинбнъцвипйвуво",
    },
    4: {
        "ciphertext": "ртжпещкофпакоеэкблфпэяртжфутвелвкхпяэзрафпэяэтйвечлещгтэябклзщрфбкрвкомтрцакрыуеблвешвтщэяхгвеофбкуафоаяхфоырыщэяхкщэкжкоыоцшткхжфвщшфб",
    },
    5: {
        "ciphertext": "эызхщлщюингкзгзщшщящзвюиртиэцлщърщцщбылтэызнщдюыхышвилиярылщящзкилиъюифыкилиъзщлтхщюяжррифиэдщцыэолтнэизргбиэызбылинрыэжсгэыджломнщюхимнилрщфюжсгэ",
    },
    6: {
        "ciphertext": "ъдичъэсдчздзоюбнояьруъзфуруъчдидчозояъдиждфшвдпуялдрщедъоийдглуъъдифэччвьярэгъдифэчшюсдглуъьъдибзхеьиурбсьеэиофбкьруерэзщуеулхясорльичьруеьвоъэйулхячкоьилучвдщвьнокофье",
    },
    7: {
        "ciphertext": "цжсзьбоъяьсфзкьсхфьчфжфыфясзьсицхутлрчевэлэзузстфеьсфхуяфьчфэлэкфьуиоуресиэылрсевхесзтфьчцдкыъреуафюьляфйьсихеыфхсклдгъзьсиръфевюхъолтзьфясткскстсрьфйьвиурьутурчзутвфофыев",
    },
    8: {
        "ciphertext": "лкывщзъштгяющгъэпонмсфъагуиимокюгмсфымпмжнъыоцушъкнэщавщкщифмсфъанэщыфмшмифъмжмгнъэвктлыэщпгуемцунщжмфяонофткыияныьщзфыпщышмцшщсминэушмцэзщьфщэмфяошмцикмцшмцсыцфышмцкйшэы",
    },
    9: {
        "ciphertext": "индульчвьхцбмцзнюиулруфтцвцбсврстфхьчрвекькафацхувлцутфиулрукькэулфящфчвцякмьчцвефчумиоузрувчстнбцулруфихслуэцтцчкмучхфтлцтрфзцюучвтцфтицглцтулруфюфйлрфчхуйефхжзцтр",
    },
    10: {
        "ciphertext": "ньжсфпншсавъужвлвъньиясрпзхшискнньядгшъхпхгпхсэйэвншхпхцгвянузнсозжмвлвъъвзгвшээвхрпжснньщзэвчуэсфясгъсглсгвшщцявлуфсяшзтмсисниясэсщдлъзъпцсмсг",
    },
    11: {
        "ciphertext": "етъмахдфснпбоцпуощпнкоеаобспыпгтмэмкркпхпьреэзмюъъмфплъощпапзехьпэьпзрпазмтмэмкрзоъйтаоплзпгнмгкзолиощпяокртмхщюцмщогкдяьмзеъйзогкмъдкпапзе",
    },
    12: {
        "ciphertext": "эщфуфзфыатзуфцрбтцсзфлтжсдрцсатсятэцчшфжчщспгщфзьнщьотяшфотяшфнщфшскшпыьасзфбтцрдсшотбтцржщсшсзвдфгжшсдсжщсщфмсхжьшсцржфэуцтнцтзротэзчмфцржфмьдсуьжфаэзтжтатзжьцрьлтцтажэсшпафцршпафцртнтшщтаьшсщрьщтурштщтжтхжэцдсуь",
    },
    13: {
        "ciphertext": "слелрэтлдюуцйцюбамйцтюфкцъцяфйецсдцнбйемьшецдцтяюфкшлехчехтхпэухшелтюэтблячелктлсчюмяфюцьлкпрлефюхптяецамтцпцеюлкхпелефрпцрйлытцпцехипэтб",
    },
    14: {
        "ciphertext": "цыщыхунфбйэъюифрыфнфъбфйспщвюыупуяцвюиуйюрфйуныщвюрфижцвюпйуяшэыцяфйыьуяыубйумюшнжфежцхыщчйуяфъюыхужыуушюуйтярифетюыучеуйуыуушюжухрцнфъфйтъфвпйуяшюш",
    },
    15: {
        "ciphertext": "ыдеыжуювыушуйуивйошяжыаоадпщйаспсцсфежнцухвяадйвеэндсицуыыутсяыубскцсбтойщчнцукжкотяэпубсыуиуцнуйошдбдадыэоыжшуяиотндйэнсяищуйуяжыукжшыдяидйвбсяищуопуцубтойщчкйэтуыэ",
    },
    16: {
        "ciphertext": "взщэоюнщмфасзедшоэзгждюзцоиынщэтдцнтсзтзщмнгюцохецфшзгшзшмзгждщнгмзщнгмзужпщфхбсфмтужвзщзымзсшгзфашгфуцеяжюзэчфхбиощузмнъншндесфщцтувзсемоумзшвеяжгугзедмнсзэрфммждэоынд",
        "key": (27, 13),
        "a_inv": 19,
        "plaintext": "подругаднеймоихсуровыхголубкадряхлаямояоднавглушилесовсосновыхдавнодавнотыждешьменятыподокномсвоейсветлицыгорюешьбудтоначасахимедлятпоминутноспицывтвоихнаморщенныхруках",
        "author": "Александр Сергеевич Пушкин",
        "work": "Няне",
        "author_work_ot": "пушкинняне",
        "author_work_st": "вохыеммтмф"
    },
    17: {
        "ciphertext": "оюэсолахуьимиыпжщыхкаинъуплыпнатдуаисъаижэнэьлилаэнпщаэолнпюэыпжаиььоытеипаквэыпяаиюпупнапдэвиуьэащнхдьупкпьлпвюэаилыиьбоаиъснъщъеэыжэыилапдвхниспдюнэшюиничхыилхлвиабоъмичхлхьвэыиамъщъощпупвбыюпщвъаапссхничхымъщилшплбпщхаюххл",
    },
    18: {
        "ciphertext": "пгсаистшгшэюыабтюфюцьцчзсгшдэсдшнвэнчгстзрюьапзскмзстшщгчадэсныскщювэсепкнюенсввачнпаьвнстсгшпыпасвэлемчгяпымзпфрнчанюаюцлбтсщпбсышфчтшглмсвашяцчстпгрцювэзчячвлцюэзютшьнюцйчончашпеаюнюэшмзпюыапзчнцсгшяцспцюсвмсзпнчкиашмйч",
    },
    19: {
        "ciphertext": "ъшъсзсйехаишйвеытйнаэочйповфевавдсйишгяфсзфщогшишфащейчшасатзгшхяэсзэсшхйпохийъосфйушфаложшишфемияжасоэетойэтцшийпишмеъоэхиосйъсыгдлолочюймйвсштйисофъосйагвйфсопочйешсштевийуяйфяамйвтмощсотйссзэъямйесаълоъоисзэлйиясяевшиаъомсофягштйвотпиымянйпотйевсаъ",
    },
    20: {
        "ciphertext": "аоювэеъизпийищжюозйгдфифределеюищдеэлозйгаоювйозфоэыоужюлейфэисйезйаоюжаестизиъисоуифитлейфэчепийфжэоьюидофвйзиэидисьийфжуизиржзжтизиъчхжийфоджзжиъэжх",
    },
    21: {
        "ciphertext": "бцъушгыэдчзкъэычохйздшыаэмнаэфспгэшмбцъушгфюэчкюышхшйчохйзфшчыеодоышсбшфшжшмфъэмгашъшфанйзйфпапезспиэтзгэчшгхпжзфъэмгашъшфанйзйышбпезтзбэыэмъэосчояжз",
    },
    22: {
        "ciphertext": "юпицьпгцлбицьпгцлапвьбьлбюибсдгьбвуюмнгшфьрепнйупуапвьдщюпгадуэапуцлйлдусдгпшгсбуйьврврепнасйюцвпювнцсуюдявнпьдебгцугэвдгрещйнйьйвубнййапуаптьцеюпндицьдвусдйьвржьбеюмнйсдиэрнй",
    },
    23: {
        "ciphertext": "фсыкжщйрбрязуьпярэислрфвйуьпфзуйэтриивьпирпутруйртэутуеуьэуьъйкфяивьяупщйсмэщащозйвтуэзйупщпкгюсмкзтгряюуеузиуэзтгрясдйуфщрясфэуяйсяпузиузщздкеяуфуэиугжщекэщтуеиужупряэриопжътоеуэсзйсзуэфпусэспвэутпсянауцряещпщьктрясээвпутниврюяслвюуйщдйщяюуйщ",
    },
    24: {
        "ciphertext": "шжрапьмщяпщдоъщдпящхпжгомязьежпужоехщьмящкпагжпьняптпайвайьмрчжщомязящыршхьыпжгохвпияосзхфщащещщыоероаотпхзютожьюхоеяпчшузтхобооырюпжгозуиащъхщажзтещймщнярержовотпзяоынзътщажспашдзмояхроущящфрзщеыпаожжротоыщъфзуршиящфр",
    },
    25: {
        "ciphertext": "лэццэхжкэьэхйъхпцзчдбъцрэцчэялэхтваъцсгцзэщърэцээаэтхээяпбъцстэюжфбфчжсрърэчжхзнсэрэщтвыатврбзавчфнчвюхфштфахзщхвпшфщсчваъчсгчдбфахфщсвцфсэбэаэыюэртпбгъхвсчвьювгсжхэчдбг",
    },
    26: {
        "ciphertext": "йцоюзхпзаьъгьъпьмцеуиьыгпзйцьгрьмцеуиьыбьхьрьмижиабвьхоргщбьхьржщцеуижньхьгьввьхаорсзхьазстовьрйэгрорегржцсзвзпщавьцзъьцьньыбжгзущъжвьриэйьриэйхмгтсзврьхтиьйьфзхжзют",
    },
    27: {
        "ciphertext": "тсвсштсвсшвядозчлвязощусафнвирвчлвятопщчсафнрщсдошстнюьчтссафщигшонвошсщсэорафнущръозоъшодсэозиоьщозоипфовъижсафдщстовтсвсщстрьиппрзьсщинтсвсвяцишстщядопоьое",
    },
    28: {
        "ciphertext": "умбйэдднйбофжлвъыдумкймйндыблвшдэытнръыдшдкдяйнръбдатынчжйбоыйндарътбнрайббъчнйбонзйяъыоблювуюдюдэбъмъыъноыдмтынчбъздычруюъбгунйхшктшыталщшъкъаъбрчбуынчшфгузктэытмъыънождадыобдншуябъчздкънрдчыбдчэкоумужадкъ",
    },
    29: {
        "ciphertext": "бчтмкликжцсабмтшюжычюрцчбжбкцбщлнчбчфрымтрыйккьчикьбчаимтклектэгсгцрелчьчткычикщжгбчклжмфсгбсючгбрптшъачбьшисюгснщтынчкюьржлшттчюгкиэкслшыщтччжктткюжлрпщебраьбчикюнткыабреэчлбсетчкьчънкиэкнщтрлтчкфсцыктэкачбэгщънрг",
    },
    30: {
        "ciphertext": "ыияыоняымйэычящючбрвжемюдцычызъчкщыизфафмнъеждбыкючиюмысбшыячщжемюдбцфмбркйщйеыяиызещжцбиожвйршыцбтышщфчйчфон",
    },
}
