from typing import Any, Dict

VARIANTS_DB: Dict[int, Dict[str, Any]] = {
    1: {
        'ciphertext': 'къыуоцльуцнльощьъщпльэрчвэщмжьщщмдуэзнлчъыршръыукэшщрутнрьэурхшлчрпрэырнутщы',
        'key': 11,
        'plaintext': 'япригласилвасгосподастемчтобысообщитьвампренеприятноеизвестиекнамедетревизор',
        'author': 'Николай Васильевич Гоголь',
        'work': 'Ревизор',
        'author_work_ot': 'гогольревизор',
        'author_work_st': 'ощощцзырнутщы'
    },
    2: {
        'ciphertext': 'юэукычбфыьфсфщчьфсчхващпцпъюэуцфыькытэъэаэысчшчсафаэьычифщчьвъэалюэукыпблфывсфщч',
        'key': 15,
        'plaintext': 'подымитемневекиневижусказалподземнымголосомвийивсесонмищекинулосьподыматьемувеки',
        'author': 'Николай Васильевич Гоголь',
        'work': 'Вий',
        'author_work_ot': 'гогольвий',
        'author_work_st': 'удээасох'
    },
    3: {
        'ciphertext': 'кшюбхшэребхшюыэбюшвабребъхжкыецбгчб',
        'key': 19,
        'plaintext': 'человекэтовеликолепноэтозвучитгордо',
        'author': 'Максим Горький',
        'work': 'На дне',
        'author_work_ot': 'горькийнадне',
        'author_work_st': 'ъхлмисегхует'
    },
    4: {
        'ciphertext': 'юмуумфгямнмфапфъувтеипущмутмкюмфчзйпушжувмрпщмуммймчфммкъипушчмлгхихтгшщпщмтгфвьшмщмр',
        'key': 7,
        'plaintext': 'чемменьшеженщинумылюбимтемлегченравимсямыейитемеевернеегубимсредьобольстительныхсетей',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'хцырителимипотулип'
    },
    5: {
        'ciphertext': 'извлитевлцьиезъвдъжязцлмвпввйкибъеяювйеъжязцзялмиецкъбевсзхжяалиыиг',
        'key': 26,
        'plaintext': 'онисошлисьволнаикаменьстихиипрозаледипламеньнестольразличнымежсобой',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'лиокдгевеабдежгебад'
    },
    6: {
        'ciphertext': 'шзоэсягфчфэиыъщсшщъпягсшящфнярифцмцщфняриюмцоъэыфюмщисшэчмомнъпяящмэщсшярьсщънчсэщяюи',
        'key': 12,
        'plaintext': 'мывсеучилисьпонемногучемунибудьикакнибудьтаквоспитаньемславабогуунаснемудреноблеснуть',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'аэъхцсеесисехзесис'
    },
    7: {
        'ciphertext': 'ьцнчзйбийяажчицзтажйэаейзгяозынчйелымаийюнад',
        'key': 27,
        'plaintext': 'бытьможнодельнымчеловекомидуматьокрасеногтей',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'лпюжвгевеабдежгебад'
    },
    8: {
        'ciphertext': 'фцщткититфхцлцкеъцфпкытнмузщншмюишыщщтцлцщуруцщдтитфхцлцкхнфцъцпкиуцщд',
        'key': 8,
        'plaintext': 'москвакакмноговэтомзвукедлясердцарусскогослилоськакмноговнемотозвалось',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'хэьсктемлеоркртилро'
    },
    9: {
        'ciphertext': 'пътрьяшигзхуюцхсюыхзвюпьюугхйхбърчрвм',
        'key': 16,
        'plaintext': 'яквампишучегожеболечтоямогуещесказать',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'дйиъхэтрутенхотуен'
    },
    10: {
        'ciphertext': 'ъюацеынцбтгцвдбнцбюшцацабцгтбызгцхчдхэбюшцдгцшзывтызшдыяждъгдяацэцбцзтъышднадянйьдя',
        'key': 22,
        'plaintext': 'дикапечальнамолчаливакакланьлеснаябоязливаонавсемьесвоейроднойказаласьдевочкойчужой',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'заоэлемлеоркртилро'
    },
    11: {
        'ciphertext': 'вегфобдобнъипцоцнгелхярсвзуцжспцсхзгргвдцзцеинипцеиург',
        'key': 3,
        'plaintext': 'яваслюблюкчемулукавитьноядругомуотданаябудувекемуверна',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'туъмлрейжёлиррейир'
    },
    12: {
        'ciphertext': 'ягйггрнюоспмвжлмимзарскюлгкмоэбмйсямкхрмжчгрмлапроюлгвюйгимзхрмижлсймлаиоюьомвлмк',
        'key': 30,
        'plaintext': 'белеетпарусодинокойвтуманеморяголубомчтоищетонвстранедалекойчтокинулонвкраюродном',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Парус',
        'author_work_ot': 'лермонтовпарус',
        'author_work_st': 'йвоклмрметыпсп'
    },
    13: {
        'ciphertext': 'ючнухчнсмсмптсйътснэыщщыючпнюьнштъънмьыунэыщбэнъгафаыяснън',
        'key': 13,
        'plaintext': 'скажикадядяведьнедароммоскваспаленнаяпожаромфранцузуотдана',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Бородино',
        'author_work_ot': 'лермонтовбородино',
        'author_work_st': 'хтърюбэгэхпъътлуэ'
    },
    14: {
        'ciphertext': 'чпмечпыхкоэвкщшзькщшсшъкцпхшбчеяшлтомшыыькхшчщъшьтмцчпчтуымпькшотчфкфщъпроптэлть',
        'key': 10,
        'plaintext': 'невынесладушапоэтапозорамелочныхобидвоссталонпротивмненийсветаодинкакпреждеиубит',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Смерть поэта',
        'author_work_ot': 'лермонтовсмертьпоэта',
        'author_work_st': 'фоэчцыэгэъмреэьцэяде'
    },
    15: {
        'ciphertext': 'ауцаугзмэьвифвгжзехввгуауцгчсувъдгцъщэзъъехжжищгябгю',
        'key': 21,
        'plaintext': 'люблюотчизнуяностранноюлюбовьюнепобедитеерассудокмой',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Родина',
        'author_work_ot': 'лермонтовродина',
        'author_work_st': 'асисещзсгисеьуе'
    },
    16: {
        'ciphertext': 'юяингщжсадвгмюруюцэьцгтяфдщшуцшхсвшуцшхяпфяуябщг',
        'key': 17,
        'plaintext': 'ночьтихапустынявнемлетбогуизвездасзвездоюговорит',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Выхожу один я на дорогу',
        'author_work_ot': 'лермонтоввыхожуодинянадорогу',
        'author_work_st': 'юяинмэдедипсеюеусипсеуегип'
    },
    17: {
        'ciphertext': 'нцпшьтунихшцчтунткпусшхшпшфуйечбзснтшчшйшэкзтуоткзмиуйа',
        'key': 5,
        'plaintext': 'искучноигрустноинекомурукуподатьвминутудушевнойневзгоды',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'И скучно и грустно',
        'author_work_ot': 'лермонтовискучноигрустно',
        'author_work_st': 'пйтрусутернхчтунткпусш'
    },
    18: {
        'ciphertext': 'юнбнуьноздючбнбишдлксквдампяйьампяьжьваьыйбнуьноздюьынбишыйбнуьноздюьлкнюкбип',
        'key': 28,
        'plaintext': 'всесчастливыесемьипохожидругнадругакаждаянесчастливаясемьянесчастливапосвоему',
        'author': 'Лев Николаевич Толстой',
        'work': 'Анна Каренина',
        'author_work_ot': 'толстойаннакаренина',
        'author_work_st': 'пйпнотвююякюнеюкюю'
    },
    19: {
        'ciphertext': 'енуждимонуошфсврфкижклпчшиошлсвублулчэжчшвещйцбнлуолчфилчшоозфслнувочэжчшоллчшвшфсврффшчщшчшиолгшоыкищынфс',
        'key': 6,
        'plaintext': 'язнаювжизнитолькодвадействительныенесчастьяугрызениесовестииболезньисчастиеестьтолькоотсутствиеэтихдвухзол',
        'author': 'Лев Николаевич Толстой',
        'work': 'Война и мир',
        'author_work_ot': 'толстойвойнаимир',
        'author_work_st': 'дефдйтзиетчлиспи'
    },
    20: {
        'ciphertext': 'дьштйуйьшьщгеибщьдьэяйуйьшьивхыугяжеычвььейфйяммщчйещщыьзьщдхбйьйбьщъвкпущичзчйещ',
        'key': 23,
        'plaintext': 'небытьтебевмосквенежитьтебеслюдьмиподалееотэтиххватоввдеревнюктеткевглушьвсаратов',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'днжътэхтсднтнопып'
    },
    21: {
        'ciphertext': 'гэешъдоунвтцбвъгэешъфтдогсдакяа',
        'key': 18,
        'plaintext': 'служитьбырадприслуживатьсятошно',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'южъуцэсеъюцэселмси'
    },
    22: {
        'ciphertext': 'ъайъыфслдоайъчлцоцйкфзнйзы',
        'key': 9,
        'plaintext': 'счастливыечасовненаблюдают',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'пъткхмэхъпънхзцуи'
    },
    23: {
        'ciphertext': 'дишвьдшзеопнэхкввмеопливпэ',
        'key': 29,
        'plaintext': 'злыеязыкистрашнеепистолета',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'воиюлеаксвнокпрюп'
    },
    24: {
        'ciphertext': 'шйльфавкж',
        'key': 24,
        'plaintext': 'асудьикто',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'ыиащжэьжъыжиэжклдш'
    },
    25: {
        'ciphertext': 'злрюьздчэбжюдюлщчлшьзызйчзлрюьздчэбжюдюлщчллщггщгилбпф',
        'key': 25,
        'plaintext': 'отчеголюдинелетаютяговорюотчеголюдинелетаюттаккакптицы',
        'author': 'Александр Николаевич Островский',
        'work': 'Гроза',
        'author_work_ot': 'островскийгроза',
        'author_work_st': 'инмплидбзеволи'
    },
    26: {
        'ciphertext': 'реущьрушутьщфыьпйакряуэюушюояыьцщцдьцьтуфтоцтбжоцъйящц',
        'key': 14,
        'plaintext': 'вчеловекедолжнобытьвсепрекрасноилицоиодеждаидушаимысли',
        'author': 'Антон Павлович Чехов',
        'work': 'Дядя Ваня',
        'author_work_ot': 'чеховдядяваня',
        'author_work_st': 'гхдцбрюрюпепу'
    },
    27: {
        'ciphertext': 'южвгьефябщыбфтфушздфюльжфт',
        'key': 20,
        'plaintext': 'ктописалнезнаюаядуракчитаю',
        'author': 'Народное творчество',
        'work': 'Фольклор',
        'author_work_ot': 'фольклор',
        'author_work_st': 'тйлщайлз'
    },
    28: {
        'ciphertext': 'увтеипуйшмпнзчьхтхлфвьюпштплзчихнмшщймффвьйплмфпрфзуйфжщфхйшяпхшщчвркзттгшспршувштпшъучзюфвркмчузфшспркмфпр',
        'key': 7,
        'plaintext': 'мылюбимвсеижархолодныхчислидарбожественныхвиденийнамвнятновсшиострыйгалльскийсмыслисумрачныйгерманскийгений',
        'author': 'Александр Александрович Блок',
        'work': 'Скифы',
        'author_work_ot': 'блоксикифы',
        'author_work_st': 'йтсеыпчпфь'
    },
    29: {
        'ciphertext': 'ъыупуэрхшлчщэюсльщннщфшжъыупуэрнчуышжрщмекэзкъщхлшръщтпшщьэлыжфчрвншщсшжэщнлыудучжьэлшрчмылэзк',
        'key': 11,
        'plaintext': 'придитекнамотужасоввойныпридитевмирныеобъятьяпоканепоздностарыймечвножнытоварищимыстанембратья',
        'author': 'Александр Александрович Блок',
        'work': 'Скифы',
        'author_work_ot': 'блокскифы',
        'author_work_st': 'мчюкфурфэ'
    },
    30: {
        'ciphertext': 'руяьыяэтмумфбмштпбяыбсгщшэыэсюхсгсэаяигцющрюцгдыьптмэицбгрэвэсгцбрэщысгщвньптсртдэсчысюяогд',
        'key': 17,
        'plaintext': 'яволкомбывыгрызбюрократизмкмандатампочтениянетуклюбымчертямсматерямикатисьлюбаябумажканоэту',
        'author': 'Владимир Владимирович Маяковский',
        'work': 'Стихи о советском паспорте',
        'author_work_ot': 'маяковскийстихиосоветскомпаспорте',
        'author_work_st': 'гпуътдеднчйлюдчдидегйэлюпфгиде'
    }
}
