from typing import Any, Dict

VARIANTS_DB: Dict[int, Dict[str, Any]] = {
    1: {
        'ciphertext': 'арсйдмбтймгбтдптрпебтужншупвьтппвъйуэгбнрсжожрсйауопжйигжтуйжлобнжежусжгйипс',
        'key': 1,
        'plaintext': 'япригласилвасгосподастемчтобысообщитьвампренеприятноеизвестиекнамедетревизор',
        'author': 'Николай Васильевич Гоголь',
        'work': 'Ревизор',
        'author_work_ot': 'гогольревизор',
        'author_work_st': 'дпдпмэсжгйипс'
    },
    2: {
        'ciphertext': 'сржэокфзопздзмкпздкихумвйвнсржйзопэоернруродклкдузурпокызмкпхнруюсржэовфюзохдзмк',
        'key': 2,
        'plaintext': 'подымитемневекиневижусказалподземнымголосомвийивсесонмищекинулосьподыматьемувеки',
        'author': 'Николай Васильевич Гоголь',
        'work': 'Вий',
        'author_work_ot': 'гогольвий',
        'author_work_st': 'ерернюдкл'
    },
    3: {
        'ciphertext': 'ъиосеинахсеиолнсоитрсахскецълхжсузс',
        'key': 3,
        'plaintext': 'человекэтовеликолепноэтозвучитгордо',
        'author': 'Максим Горький',
        'work': 'На дне',
        'author_work_ot': 'горькийнадне',
        'author_work_st': 'жсуянлмргзри'
    },
    4: {
        'ciphertext': 'ыйррйсаьйкйсэмсчряпвемрцйрпйзыйсфджмрхгряйнмцйрййжйфсййзчемрхфйиатетпахцмцйпасящхйцйн',
        'key': 4,
        'plaintext': 'чемменьшеженщинумылюбимтемлегченравимсямыейитемеевернеегубимсредьобольстительныхсетей',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'учьомсйжзйсмнтсйзмс'
    },
    5: {
        'ciphertext': 'утнцуэрнцбзуртенпесктбцчнъннфхумеркйнфресктбткцчурбхемрньтасклцужуо',
        'key': 5,
        'plaintext': 'онисошлисьволнаикаменьстихиипрозаледипламеньнестольразличнымежсобой',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'фшэпнткзиктноуткинт'
    },
    6: {
        'ciphertext': 'тбичлщэосочвхфултуфйщэлтщуозщкворжруозщквшжрифчхошжувлтчсжижзфйщщужчултщкцлуфзслчущшв',
        'key': 6,
        'plaintext': 'мывсеучилисьпонемногучемунибудьикакнибудьтаквоспитаньемславабогуунаснемудреноблеснуть',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'хщюроулийлуопфулйоу'
    },
    7: {
        'ciphertext': 'ивщгухнфхлмтгфвуюмтхймсхуплъузщгхсчзшмфхкщмр',
        'key': 7,
        'plaintext': 'бытьможнодельнымчеловекомидуматьокрасеногтей',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'цъяспфмйкмфпрхфмкпф'
    },
    8: {
        'ciphertext': 'фцщткититфхцлцкеъцфпкытнмузщншмюишыщщтцлцщуруцщдтитфхцлцкхнфцъцпкиуцщд',
        'key': 8,
        'plaintext': 'москвакакмноговэтомзвукедлясердцарусскогослилоськакмноговнемотозвалось',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'чыатрхнклнхрсцхнлрх'
    },
    9: {
        'ciphertext': 'иулйхшсбьаомчпокчфоаычихчмьовоъуйрйые',
        'key': 9,
        'plaintext': 'яквампишучегожеболечтоямогуещесказать',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'шьбусцолмоцстчцомсц'
    },
    10: {
        'ciphertext': 'отфкщпбкхжчкцшхбкхтмкфкфхкчжхпычкйлшйсхтмкшчкмыпцжпымшпуъшочшуфкскхкыжопмшбфшубэршу',
        'key': 10,
        'plaintext': 'дикапечальнамолчаливакакланьлеснаябоязливаонавсемьесвоейроднойказаласьдевочкойчужой',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'щэвфтчпмнпчтушчпнтч'
    },
    11: {
        'ciphertext': 'кнльцймцйхврчюцюхлнуэзшщкпыюощчющэплшлкмюпюнрхрчюнрышл',
        'key': 11,
        'plaintext': 'яваслюблюкчемулукавитьноядругомуотданаябудувекемуверна',
        'author': 'Александр Сергеевич Пушкин',
        'work': 'Евгений Онегин',
        'author_work_ot': 'пушкиневгенийонегин',
        'author_work_st': 'ъюгхушрноршуфщшроуш'
    },
    12: {
        'ciphertext': 'нсчссюымьяэърфщъцъхоюяшмщсшъьлпъчянъшгюъфесюъщоэюьмщсрмчсцъхгюъцфщячъщоцьмкьърщъш',
        'key': 12,
        'plaintext': 'белеетпарусодинокойвтуманеморяголубомчтоищетонвстранедалекойчтокинулонвкраюродном',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Парус',
        'author_work_ot': 'лермонтовпарус',
        'author_work_st': 'чсьшъщюъоымьяэ'
    },
    13: {
        'ciphertext': 'ючнухчнсмсмптсйътснэыщщыючпнюьнштъънмьыунэыщбэнъгафаыяснън',
        'key': 13,
        'plaintext': 'скажикадядяведьнедароммоскваспаленнаяпожаромфранцузуотдана',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Бородино',
        'author_work_ot': 'лермонтовбородино',
        'author_work_st': 'штэщыъяыпоыэысхъы'
    },
    14: {
        'ciphertext': 'ыурйыуящотбжоэьлаоэьхьюоъущьеыйгьпцтрьяяаощьыэюьацръыуыцчяруаоьтцышошэюуфтуцбпца',
        'key': 14,
        'plaintext': 'невынесладушапоэтапозорамелочныхобидвоссталонпротивмненийсветаодинкакпреждеиубит',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Смерть поэта',
        'author_work_ot': 'лермонтовсмертьпоэта',
        'author_work_st': 'щуюъьыаьряъуюакэьлао'
    },
    15: {
        'ciphertext': 'ънрънэбжчцьвоьэабяпььэнънрэслньфюэрфучбффяпаавуэщыэш',
        'key': 15,
        'plaintext': 'люблюотчизнуяностранноюлюбовьюнепобедитеерассудокмой',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Родина',
        'author_work_ot': 'лермонтовродина',
        'author_work_st': 'ъфяыэьбэсяэучьп'
    },
    16: {
        'ciphertext': 'эюзмвшерягбвлэптэхьыхвсюугшчтхчфрбчтхчфюоуютюашв',
        'key': 16,
        'plaintext': 'ночьтихапустынявнемлетбогуизвездасзвездоюговорит',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'Выхожу один я на дорогу',
        'author_work_ot': 'лермонтоввыхожуодинянадорогу',
        'author_work_st': 'ыхаьюэвюттлеюцгюфшэпэрфюаюуг'
    },
    17: {
        'ciphertext': 'щвыдиюящфбдвгюящюцыяэдбдыдаяхсгнуэщюдгдхдйцуюяъюцушфяхм',
        'key': 17,
        'plaintext': 'искучноигрустноинекомурукуподатьвминутудушевнойневзгоды',
        'author': 'Михаил Юрьевич Лермонтов',
        'work': 'И скучно и грустно',
        'author_work_ot': 'лермонтовискучноигрустно',
        'author_work_st': 'ьцбэяюгяущвыдиюящфбдвгюя'
    },
    18: {
        'ciphertext': 'фгчгйтгдэъфнчгчюоъбазашъцвехятцвехтьтшцтсячгйтгдэъфтсгчюосячгйтгдэъфтбагфачюе',
        'key': 18,
        'plaintext': 'всесчастливыесемьипохожидругнадругакаждаянесчастливаясемьянесчастливапосвоему',
        'author': 'Лев Николаевич Толстой',
        'work': 'Анна Каренина',
        'author_work_ot': 'толстойаннакаренина',
        'author_work_st': 'даэгдаытяятьтвчяъят'
    },
    19: {
        'ciphertext': 'тъаусхщыъаыебюпэбчхучшьдехыешюпаошашдкудептжцгоъшаышдбхшдеыыфбюшъапыдкудеышшдепебюпэббеджедехышреыичхжиъбю',
        'key': 19,
        'plaintext': 'язнаювжизнитолькодвадействительныенесчастьяугрызениесовестииболезньисчастиеестьтолькоотсутствиеэтихдвухзол',
        'author': 'Лев Николаевич Толстой',
        'work': 'Война и мир',
        'author_work_ot': 'толстойвойнаимир',
        'author_work_st': 'ебюдебьхбьауыяыг'
    },
    20: {
        'ciphertext': 'бщхпжржщхщцавеюцщбщъьжржщхщеятшраьгвшфящщвжсжьййцфжвццшщдщцбтюжщжющцчязмрцефдфжвц',
        'key': 20,
        'plaintext': 'небытьтебевмосквенежитьтебеслюдьмиподалееотэтиххватоввдеревнюктеткевглушьвсаратов',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'чдьхвщшвцчвдщвжзаф'
    },
    21: {
        'ciphertext': 'жаиыэзсцрехщдеэжаиыэчхзсжфзгнвг',
        'key': 21,
        'plaintext': 'служитьбырадприслуживатьсятошно',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'шеэцгъщгчшгеъгзибх'
    },
    22: {
        'ciphertext': 'знцзибюшсынцздшгыгцчбфъцфи',
        'key': 22,
        'plaintext': 'счастливыечасовненаблюдают',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'щжючдыъдшщджыдийвц'
    },
    23: {
        'ciphertext': 'ювтьцютбяийзчпдььжяийевьйч',
        'key': 23,
        'plaintext': 'злыеязыкистрашнеепистолета',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'ъзяшеьыещъезьейкгч'
    },
    24: {
        'ciphertext': 'шйльфавкж',
        'key': 24,
        'plaintext': 'асудьикто',
        'author': 'Александр Сергеевич Грибоедов',
        'work': 'Горе от ума',
        'author_work_ot': 'грибоедовгореотума',
        'author_work_st': 'ыиащжэьжъыжиэжклдш'
    },
    25: {
        'ciphertext': 'злрюьздчэбжюдюлщчлшьзызйчзлрюьздчэбжюдюлщчллщггщгилбпф',
        'key': 25,
        'plaintext': 'отчеголюдинелетаютяговорюотчеголюдинелетаюттаккакптицы',
        'author': 'Александр Николаевич Островский',
        'work': 'Гроза',
        'author_work_ot': 'островскийгроза',
        'author_work_st': 'зклйзыкгбвьйзащ'
    },
    26: {
        'ciphertext': 'ьсяеиьядяюиеазиыхмцьляйкядкълзивевривиюяаюъвюнтъвжхлев',
        'key': 26,
        'plaintext': 'вчеловекедолжнобытьвсепрекрасноилицоиодеждаидушаимысли',
        'author': 'Антон Павлович Чехов',
        'work': 'Дядя Ваня',
        'author_work_ot': 'чеховдядяваня',
        'author_work_st': 'сяпиьющющьъзщ'
    },
    27: {
        'ciphertext': 'енйкгмыжиавиыщыъяолыетгныщ',
        'key': 27,
        'plaintext': 'ктописалнезнаюаядуракчитаю',
        'author': 'Народное творчество',
        'work': 'Фольклор',
        'author_work_ot': 'фольклор',
        'author_work_st': 'пйжчежйл'
    },
    28: {
        'ciphertext': 'ичзъэдиюнбдвьмскзкайчсуднздаьмэквбноюбййчсюдабйдейьиюйыойкюнфдкномчеяьззшнжденичнзднпимьуйчеябмиьйнждеябйде',
        'key': 28,
        'plaintext': 'мылюбимвсеижархолодныхчислидарбожественныхвиденийнамвнятновсшиострыйгалльскийсмыслисумрачныйгерманскийгений',
        'author': 'Александр Александрович Блок',
        'work': 'Скифы',
        'author_work_ot': 'блоксикифы',
        'author_work_st': 'эзкжндждрч'
    },
    29: {
        'ciphertext': 'мнебепвзкэйлпргэоляялжкшмнебепвяйенкшвлючьпщьмлзэквмлдбклопэншжйвфяклгкшпляэнецейшопэквйюнэпщь',
        'key': 29,
        'plaintext': 'придитекнамотужасоввойныпридитевмирныеобъятьяпоканепоздностарыймечвножнытоварищимыстанембратья',
        'author': 'Александр Александрович Блок',
        'work': 'Скифы',
        'author_work_ot': 'блокскифы',
        'author_work_st': 'юилзозесш'
    },
    30: {
        'ciphertext': 'эамйимкящащбощеяьомиоюржекикюлвюрюкнмхрглжэлгрсийьящкхгорэкпкюргоэкжиюржпъйьяюэяскюдиюлмырс',
        'key': 30,
        'plaintext': 'яволкомбывыгрызбюрократизмкмандатампочтениянетуклюбымчертямсматерямикатисьлюбаябумажканоэту',
        'author': 'Владимир Владимирович Маяковский',
        'work': 'Стихи о советском паспорте',
        'author_work_ot': 'маяковскийстихиосоветскомпаспорте',
        'author_work_st': 'кюэимапижзпржужмпмагрпимкнюпнморг'
    },
}
